import '../pages.css'

export const MyHistorys = () => {
  return (
    <div className='container-pages'>
      <h3>История создания</h3>
      <p>
        Начало создания подобной программы уходит в 2010-2013гг. Послужило
        толчком то, что инженерный состав начинал работу с позднего времени,
        относительно `рядового состава`. Потребности в помощи по расчетам,
        персчетам, возникали с началом рабочего дня `рядового состава`. :)
      </p>
      <p>
        У меня дома без дела валялся нетбук. И я подумал, почему бы не
        использовать его для расчетов. Так как имелось увлечение
        програмированием, то это увлечение было направлено на извлечение выгоды
        на рабочем месте. Здесь имелись сплошные плюсы. Так как программу кодил
        сам для себя, и как удобно мне. Так же очень экономилось время и нервы.
        Ну и конечно же практика в кодинге. При написании многих формул,
        пришлось вспоминать школьную программу по геометрии :)
      </p>
      <p>
        На тот момент писал на Delphi. Программка обрастала разными
        дополнительными функциями. Была даже своя база по сделанным заказам. Да
        и много чего еще, даже до конца не смог реализовать все то, что хотел.
        Ну наверно сказалось то, что опыта совсем маловато было, было только
        желание :P
      </p>
      <p>
        Новое увлечение HTML и CSS началось с того что мне нужно было написать
        справку для программки. А так как с помощью этих инструментов можно
        оформить очень класные справки и описания (на тот момент мне нужно было
        только это), я стал изучать новое направление. Ну а там пошел и JS в
        ход. Короче понравилось...
      </p>
      <p>
        Ну и желание перенести свою программку на новые рельсы, конечно
        возникло. Тем более что возможностей для оформления просто не
        ограниченные, в отличие от Delphi. Данная программа, - это третья
        реинкарнация. По мере своего `роста`, хочется что то изменять и
        переделать. Эту версию решил сделать с помощью REACT, и других
        технологий...
      </p>
    </div>
  )
}
