import '../pages.css'

export const Bevel = () => {
  return (
    <div className='container-pages'>
      <h3>Расчет фаски</h3>
      <p>
        Кто то называет ее технологической, что в принципе правда. В разных
        случаях фаска может быть разной, как по ширине, так и по углу. С помошью
        этой формулы можно расчитать и то, и другое. и даже заложить толщину на
        обработку, и получить нужный результат. Т.е. можем заранее задать такой
        размер, при котором, в процессе обработки получится заданная фаска с
        нужным углом.
      </p>
    </div>
  )
}
