import '../pages.css'

export const DeflectionArrow = () => {
  return (
    <div className='container-pages'>
      <h3>Стрелка прогиба</h3>
      <p>
        Стрелка прогиба - это разница между плоскостью и радиусом, на
        определенный диаметр. Можно сказать что это высота от плоскости до
        наиболее удаленной точки радиуса, т.е. высота сегмента. Или если
        сравнивать два радиуса, то это разница между ними в средней зоне, опять
        же на определенный диаметр.
      </p>
    </div>
  )
}
